<template>
  <v-dialog
    v-model="dialog"
    :value="show"
    max-width="1000px"
    padding="0px"
    class="payment-menu-patchnote-window"
    @input="$emit('close')"
  >
    <v-card>
      <v-card-title>
        <v-row>
          <v-col cols="12">
            <span class="headline">Список изменений в "Реестре оплат"</span>
          </v-col>
        </v-row>
      </v-card-title>

      <div class="payment-menu-patchnote-window-text">
        <v-container>
          <v-row>
            <v-col cols="12">
              <span class="headline">21.05.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>Добавлено отображение денежных сумм с пробелами между разрядами на всех формах</li>
                <li>
                  Доработана форма "Журнал документов на оплату" - теперь можно посмотреть список документов к оплате и остатки на р/с на конкретную дату,
                  в списоке документов на оплату отображаются только документы на текущую дату
                </li>
                <li>
                  Примечание документов на оплату перенесено в конец таблицы -
                  теперь чтобы посмотреть примечание конкретного документа нужно на него нажать левой кнопкой мыши в таблице "Документы на оплату"
                </li>
                <li>
                  Добавлена возможность оплачивать документы на оплату по
                  нажатию правой кнопкой мыши по документу в таблице "Документы на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">24.05.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <span class="headline">Журнал документов на оплату</span>
                <li>Установлена фиксированная ширина для колонок таблицы "Документы на оплату" </li>
                <li>
                  Шапка таблицы "Документы на оплату"  зафиксирована
                </li>
                <li>
                  Итоги таблицы "Документы на оплату" выведены под таблицу
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">25.05.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <span class="headline">Журнал документов на оплату</span>
                <li>
                  Добавлены фильтры для таблицы "Документы на оплату".
                  Наложенные фильтры сохраняются для пользователя, который эти фильтры наложил, благодаря чему фильтры будут актуальны после перезахода в систему.
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">26.05.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <span class="headline">Журнал маркировок</span>
                <li>
                  Формы "Gtin" и "Журнал кодов маркировок" теперь объеденены в одну форму. На каждой из них есть кнопка для перехода в другую.
                </li>
                <li>
                  На форму "Журнал кодов маркировок" добвлен фильтр по дате и номеру заказа
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">27.05.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Доработана авторизация пользователей.
                </li>
                <span class="headline">Меню реестра оплат</span>
                <li>
                  Добавлен график, отображающий информацию о документах на оплату
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">01.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлена форма редактирования прав пользователей
                </li>
                <li>
                  Добавлена проверка прав пользователя перед входом в меню АРМов
                </li>
                <li>
                  Добавлена форма добавления нового пользователя
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">02.06.2021 - 08.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Доработки основных форм АРМ Реестр оплат и исправления ошибок
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">09.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлена страница настройки аккаунта для текущего пользователя
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">10.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлена фильтрация документов на оплату по создателю документа и по полю "К оплате"
                </li>
                <li>
                  Фикс бага не сохранения нового GTIN кода
                </li>
                <li>
                  Фикс бага удаления документа на оплату
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">11.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <span class="headline">Таблица "Документы на оплату" Журанала документов на оплату</span>
                <li>
                  Обновлена таблица "Документы на оплату" журнала документа на оплату - добавлена возможность просмотра большого количества записей (к примеру больше 500 тыс. записей)
                </li>
                <li>
                  Добавлена серверная фильтрация записей таблицы "Документы на оплату" по полю "К оплате"
                </li>
                <li>
                  Добавлен фильтр по полю "Дата документа"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">15.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлены номера р/с к наименованию счета на форме "Ввод остатков по р/с"
                </li>
                <li>
                  Доработка бизнес-логики формы "Журнал документов на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">16.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Уткин Дмитрий - добавлено перемещение по таблице расчетных счетов на форме "Ввод остатков по р/с"
                </li>
                <li>
                  Переработан процесс получения информации по р/с на форме "Ввод остатков по р/с"
                </li>
                <li>
                  Сгруппированы кнопки добавления основных документов (документ на оплату, оплата по кассе внутренний платеж) в одну общую на форме "Журнал документов на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">17.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлена возможность редактирования настроек пользовательского интерфеса на форме администратора
                </li>
                <li>
                  Доработки визуализации интерфейса формы "Журнал документов на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">18.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Доработана форма "Журнал рассылки на email документов на оплату" - группировка документов осуществляется по полю "Покупатель"
                </li>
                <li>
                  Исправлена ошибка на форме "Журнал документов на оплату" - после заведения нового документа оплата по кассе не апдетился остаток на кассовом счете.
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">20.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Уткин Дмитрий - оптимизация и повышение производительности формы "Ввод остатков по р/с"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">23.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Доработка фильтров на форме "Журнал документов на оплату"
                </li>
                <li>
                  Уткин Дмитрий - доработка бизнес-логики "Ввод остатков по р/с"
                </li>
                <li>
                  Добавлен функционал редактирования ролей пользователей на форме администратора
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">24.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Устранение ошибок, выявленных в ходе тестирования на формах "Журнал рассылки по e-mail", "Журнал документов на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">27.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Уткин Дмитрий - доработка бизнес-логики формы "Журнал документов на оплату"
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">28.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  При регистрации нового пользователя добавлена проверка на логин
                </li>
                <li>
                  В "Реестр оплат" добавлен доступ к формам взависимости от роли
                </li>
                <li>
                  Добавлено редактирование оплаты по кассе и реализован функционал для редактирования, копирования и удаления внутренних документов
                </li>
              </ul>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <span class="headline">29.06.2021</span>
            </v-col>
          </v-row>

          <v-row>
            <v-col cols="12">
              <ul>
                <li>
                  Добавлено ограничение для функцинала создания оплаты по кассе/ внутреннего платежа/ оплаты документа по роли пользователя
                </li>
                <li>
                  Доработана форма "Карточка оплат по документу"
                </li>
                <li>
                  Переадресация после авторизации теперь перенаправляет пользователя в корневой каталог интерфейса
                </li>
                <li>
                  На все формы добавлены навигация
                </li>
              </ul>
            </v-col>
          </v-row>
        </v-container>
      </div>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  name: 'PaymentMenuPatchnoteWindow',

  props: {
    show: {
      type: Boolean,
      default: false
    }
  },

  data() {
    return {
      // Переменная для реализации открытия модального окна
      dialog: false
    }
  },

  methods: {
    openWindow() {
      this.dialog = true
    }
  }
}
</script>

<style lang="scss">
.payment-menu-patchnote-window-text {
    padding: 0 24px 20px;
    font-size: 0.875rem;
    font-weight: 400;
    line-height: 1.375rem;
    letter-spacing: 0.0071428571em;
}

</style>
